/* automatically generated by rust-bindgen 0.59.2 */

pub const __WORDSIZE: u32 = 64;
pub const __DARWIN_ONLY_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const __DARWIN_ONLY_VERS_1050: u32 = 1;
pub const __DARWIN_UNIX03: u32 = 1;
pub const __DARWIN_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_VERS_1050: u32 = 1;
pub const __DARWIN_NON_CANCELABLE: u32 = 0;
pub const __DARWIN_SUF_EXTSN: &[u8; 14usize] = b"$DARWIN_EXTSN\0";
pub const __DARWIN_C_ANSI: u32 = 4096;
pub const __DARWIN_C_FULL: u32 = 900000;
pub const __DARWIN_C_LEVEL: u32 = 900000;
pub const __STDC_WANT_LIB_EXT1__: u32 = 1;
pub const __DARWIN_NO_LONG_LONG: u32 = 0;
pub const _DARWIN_FEATURE_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_VERS_1050: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const _DARWIN_FEATURE_UNIX_CONFORMANCE: u32 = 3;
pub const __has_ptrcheck: u32 = 0;
pub const __PTHREAD_SIZE__: u32 = 8176;
pub const __PTHREAD_ATTR_SIZE__: u32 = 56;
pub const __PTHREAD_MUTEXATTR_SIZE__: u32 = 8;
pub const __PTHREAD_MUTEX_SIZE__: u32 = 56;
pub const __PTHREAD_CONDATTR_SIZE__: u32 = 8;
pub const __PTHREAD_COND_SIZE__: u32 = 40;
pub const __PTHREAD_ONCE_SIZE__: u32 = 8;
pub const __PTHREAD_RWLOCK_SIZE__: u32 = 192;
pub const __PTHREAD_RWLOCKATTR_SIZE__: u32 = 16;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;

pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST64_MIN: i64 = -9223372036854775808;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const INT_LEAST64_MAX: u64 = 9223372036854775807;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const UINT_LEAST64_MAX: i32 = -1;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i32 = -32768;
pub const INT_FAST32_MIN: i32 = -2147483648;
pub const INT_FAST64_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u32 = 32767;
pub const INT_FAST32_MAX: u32 = 2147483647;
pub const INT_FAST64_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: u32 = 65535;
pub const UINT_FAST32_MAX: u32 = 4294967295;
pub const UINT_FAST64_MAX: i32 = -1;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const UINTPTR_MAX: i32 = -1;
pub const SIZE_MAX: i32 = -1;
pub const RSIZE_MAX: i32 = -1;
pub const WINT_MIN: i32 = -2147483648;
pub const WINT_MAX: u32 = 2147483647;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const uiPi: f64 = 3.141592653589793;
pub const uiDrawDefaultMiterLimit: f64 = 10.0;
pub const uiTableModelColumnNeverEditable: i32 = -1;
pub const uiTableModelColumnAlwaysEditable: i32 = -2;
pub type size_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_int;
pub type max_align_t = f64;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        128usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__mbstate8 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__mbstate8)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>()))._mbstateL as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(_mbstateL)
        )
    );
}
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[test]
fn bindgen_test_layout___darwin_pthread_handler_rec() {
    assert_eq!(
        ::std::mem::size_of::<__darwin_pthread_handler_rec>(),
        24usize,
        concat!("Size of: ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        ::std::mem::align_of::<__darwin_pthread_handler_rec>(),
        8usize,
        concat!("Alignment of ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__darwin_pthread_handler_rec>())).__routine as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__routine)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__darwin_pthread_handler_rec>())).__arg as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__arg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__darwin_pthread_handler_rec>())).__next as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_attr_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_attr_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_attr_t>())).__opaque as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_cond_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_cond_t>())).__opaque as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_condattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_condattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_condattr_t>())).__sig as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_condattr_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutex_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_mutex_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_mutex_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutexattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutexattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_mutexattr_t>())).__sig as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_mutexattr_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_once_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_once_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_once_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_once_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_once_t>())).__opaque as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlock_t>(),
        200usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_rwlock_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_rwlock_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlockattr_t>(),
        24usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_rwlockattr_t>())).__sig as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_rwlockattr_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_t>(),
        8192usize,
        concat!("Size of: ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_t>())).__cleanup_stack as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__cleanup_stack)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_t>())).__opaque as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__opaque)
        )
    );
}
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
pub type uiForEach = ::std::os::raw::c_uint;
pub const uiForEachContinue: ::std::os::raw::c_uint = 0;
pub const uiForEachStop: ::std::os::raw::c_uint = 1;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiInitOptions {
    pub Size: size_t,
}
#[test]
fn bindgen_test_layout_uiInitOptions() {
    assert_eq!(
        ::std::mem::size_of::<uiInitOptions>(),
        8usize,
        concat!("Size of: ", stringify!(uiInitOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<uiInitOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(uiInitOptions))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiInitOptions>())).Size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uiInitOptions),
            "::",
            stringify!(Size)
        )
    );
}
extern "C" {
    pub fn uiInit(options: *mut uiInitOptions) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn uiUninit();
}
extern "C" {
    pub fn uiFreeInitError(err: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn uiMain();
}
extern "C" {
    pub fn uiMainSteps();
}
extern "C" {
    pub fn uiMainStep(wait: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiQuit();
}
extern "C" {
    pub fn uiQueueMain(
        f: ::std::option::Option<unsafe extern "C" fn(data: *mut ::std::os::raw::c_void)>,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiTimer(
        milliseconds: ::std::os::raw::c_int,
        f: ::std::option::Option<
            unsafe extern "C" fn(data: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiOnShouldQuit(
        f: ::std::option::Option<
            unsafe extern "C" fn(data: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiFreeText(text: *mut ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiControl {
    pub Signature: u32,
    pub OSSignature: u32,
    pub TypeSignature: u32,
    pub Destroy: ::std::option::Option<unsafe extern "C" fn(arg1: *mut uiControl)>,
    pub Handle: ::std::option::Option<unsafe extern "C" fn(arg1: *mut uiControl) -> usize>,
    pub Parent: ::std::option::Option<unsafe extern "C" fn(arg1: *mut uiControl) -> *mut uiControl>,
    pub SetParent:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut uiControl, arg2: *mut uiControl)>,
    pub Toplevel:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut uiControl) -> ::std::os::raw::c_int>,
    pub Visible:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut uiControl) -> ::std::os::raw::c_int>,
    pub Show: ::std::option::Option<unsafe extern "C" fn(arg1: *mut uiControl)>,
    pub Hide: ::std::option::Option<unsafe extern "C" fn(arg1: *mut uiControl)>,
    pub Enabled:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut uiControl) -> ::std::os::raw::c_int>,
    pub Enable: ::std::option::Option<unsafe extern "C" fn(arg1: *mut uiControl)>,
    pub Disable: ::std::option::Option<unsafe extern "C" fn(arg1: *mut uiControl)>,
}
#[test]
fn bindgen_test_layout_uiControl() {
    assert_eq!(
        ::std::mem::size_of::<uiControl>(),
        104usize,
        concat!("Size of: ", stringify!(uiControl))
    );
    assert_eq!(
        ::std::mem::align_of::<uiControl>(),
        8usize,
        concat!("Alignment of ", stringify!(uiControl))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiControl>())).Signature as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uiControl),
            "::",
            stringify!(Signature)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiControl>())).OSSignature as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(uiControl),
            "::",
            stringify!(OSSignature)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiControl>())).TypeSignature as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uiControl),
            "::",
            stringify!(TypeSignature)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiControl>())).Destroy as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uiControl),
            "::",
            stringify!(Destroy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiControl>())).Handle as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uiControl),
            "::",
            stringify!(Handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiControl>())).Parent as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uiControl),
            "::",
            stringify!(Parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiControl>())).SetParent as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uiControl),
            "::",
            stringify!(SetParent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiControl>())).Toplevel as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(uiControl),
            "::",
            stringify!(Toplevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiControl>())).Visible as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(uiControl),
            "::",
            stringify!(Visible)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiControl>())).Show as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(uiControl),
            "::",
            stringify!(Show)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiControl>())).Hide as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(uiControl),
            "::",
            stringify!(Hide)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiControl>())).Enabled as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(uiControl),
            "::",
            stringify!(Enabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiControl>())).Enable as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(uiControl),
            "::",
            stringify!(Enable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiControl>())).Disable as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(uiControl),
            "::",
            stringify!(Disable)
        )
    );
}
extern "C" {
    pub fn uiControlDestroy(arg1: *mut uiControl);
}
extern "C" {
    pub fn uiControlHandle(arg1: *mut uiControl) -> usize;
}
extern "C" {
    pub fn uiControlParent(arg1: *mut uiControl) -> *mut uiControl;
}
extern "C" {
    pub fn uiControlSetParent(arg1: *mut uiControl, arg2: *mut uiControl);
}
extern "C" {
    pub fn uiControlToplevel(arg1: *mut uiControl) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiControlVisible(arg1: *mut uiControl) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiControlShow(arg1: *mut uiControl);
}
extern "C" {
    pub fn uiControlHide(arg1: *mut uiControl);
}
extern "C" {
    pub fn uiControlEnabled(arg1: *mut uiControl) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiControlEnable(arg1: *mut uiControl);
}
extern "C" {
    pub fn uiControlDisable(arg1: *mut uiControl);
}
extern "C" {
    pub fn uiAllocControl(
        n: size_t,
        OSsig: u32,
        typesig: u32,
        typenamestr: *const ::std::os::raw::c_char,
    ) -> *mut uiControl;
}
extern "C" {
    pub fn uiFreeControl(arg1: *mut uiControl);
}
extern "C" {
    pub fn uiControlVerifySetParent(arg1: *mut uiControl, arg2: *mut uiControl);
}
extern "C" {
    pub fn uiControlEnabledToUser(arg1: *mut uiControl) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiUserBugCannotSetParentOnToplevel(type_: *const ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiWindow {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiWindowTitle(w: *mut uiWindow) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn uiWindowSetTitle(w: *mut uiWindow, title: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn uiWindowContentSize(
        w: *mut uiWindow,
        width: *mut ::std::os::raw::c_int,
        height: *mut ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn uiWindowSetContentSize(
        w: *mut uiWindow,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn uiWindowFullscreen(w: *mut uiWindow) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiWindowSetFullscreen(w: *mut uiWindow, fullscreen: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiWindowBorderless(w: *mut uiWindow) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiWindowSetBorderless(w: *mut uiWindow, borderless: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiWindowSetChild(w: *mut uiWindow, child: *mut uiControl);
}
extern "C" {
    pub fn uiWindowMargined(w: *mut uiWindow) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiWindowSetMargined(w: *mut uiWindow, margined: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiWindowResizeable(w: *mut uiWindow) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiWindowSetResizeable(w: *mut uiWindow, resizeable: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiNewWindow(
        title: *const ::std::os::raw::c_char,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        hasMenubar: ::std::os::raw::c_int,
    ) -> *mut uiWindow;
}
extern "C" {
    pub fn uiWindowOnContentSizeChanged(
        w: *mut uiWindow,
        f: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut uiWindow, arg2: *mut ::std::os::raw::c_void),
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiWindowOnClosing(
        w: *mut uiWindow,
        f: ::std::option::Option<
            unsafe extern "C" fn(
                w: *mut uiWindow,
                data: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiWindowOnFocusChanged(
        w: *mut uiWindow,
        f: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut uiWindow, arg2: *mut ::std::os::raw::c_void),
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiWindowFocused(w: *mut uiWindow) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiButton {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiButtonText(b: *mut uiButton) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn uiButtonSetText(b: *mut uiButton, text: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn uiButtonOnClicked(
        b: *mut uiButton,
        f: ::std::option::Option<
            unsafe extern "C" fn(b: *mut uiButton, data: *mut ::std::os::raw::c_void),
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiNewButton(text: *const ::std::os::raw::c_char) -> *mut uiButton;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiBox {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiBoxAppend(b: *mut uiBox, child: *mut uiControl, stretchy: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiBoxNumChildren(b: *mut uiBox) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiBoxDelete(b: *mut uiBox, index: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiBoxPadded(b: *mut uiBox) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiBoxSetPadded(b: *mut uiBox, padded: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiNewHorizontalBox() -> *mut uiBox;
}
extern "C" {
    pub fn uiNewVerticalBox() -> *mut uiBox;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiCheckbox {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiCheckboxText(c: *mut uiCheckbox) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn uiCheckboxSetText(c: *mut uiCheckbox, text: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn uiCheckboxOnToggled(
        c: *mut uiCheckbox,
        f: ::std::option::Option<
            unsafe extern "C" fn(c: *mut uiCheckbox, data: *mut ::std::os::raw::c_void),
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiCheckboxChecked(c: *mut uiCheckbox) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiCheckboxSetChecked(c: *mut uiCheckbox, checked: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiNewCheckbox(text: *const ::std::os::raw::c_char) -> *mut uiCheckbox;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiEntry {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiEntryText(e: *mut uiEntry) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn uiEntrySetText(e: *mut uiEntry, text: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn uiEntryOnChanged(
        e: *mut uiEntry,
        f: ::std::option::Option<
            unsafe extern "C" fn(e: *mut uiEntry, data: *mut ::std::os::raw::c_void),
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiEntryReadOnly(e: *mut uiEntry) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiEntrySetReadOnly(e: *mut uiEntry, readonly: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiNewEntry() -> *mut uiEntry;
}
extern "C" {
    pub fn uiNewPasswordEntry() -> *mut uiEntry;
}
extern "C" {
    pub fn uiNewSearchEntry() -> *mut uiEntry;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiLabel {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiLabelText(l: *mut uiLabel) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn uiLabelSetText(l: *mut uiLabel, text: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn uiNewLabel(text: *const ::std::os::raw::c_char) -> *mut uiLabel;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiTab {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiTabAppend(t: *mut uiTab, name: *const ::std::os::raw::c_char, c: *mut uiControl);
}
extern "C" {
    pub fn uiTabInsertAt(
        t: *mut uiTab,
        name: *const ::std::os::raw::c_char,
        before: ::std::os::raw::c_int,
        c: *mut uiControl,
    );
}
extern "C" {
    pub fn uiTabDelete(t: *mut uiTab, index: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiTabNumPages(t: *mut uiTab) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiTabMargined(t: *mut uiTab, page: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiTabSetMargined(
        t: *mut uiTab,
        page: ::std::os::raw::c_int,
        margined: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn uiNewTab() -> *mut uiTab;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiGroup {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiGroupTitle(g: *mut uiGroup) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn uiGroupSetTitle(g: *mut uiGroup, title: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn uiGroupSetChild(g: *mut uiGroup, c: *mut uiControl);
}
extern "C" {
    pub fn uiGroupMargined(g: *mut uiGroup) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiGroupSetMargined(g: *mut uiGroup, margined: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiNewGroup(title: *const ::std::os::raw::c_char) -> *mut uiGroup;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiSpinbox {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiSpinboxValue(s: *mut uiSpinbox) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiSpinboxSetValue(s: *mut uiSpinbox, value: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiSpinboxOnChanged(
        s: *mut uiSpinbox,
        f: ::std::option::Option<
            unsafe extern "C" fn(s: *mut uiSpinbox, data: *mut ::std::os::raw::c_void),
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiNewSpinbox(min: ::std::os::raw::c_int, max: ::std::os::raw::c_int) -> *mut uiSpinbox;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiSlider {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiSliderValue(s: *mut uiSlider) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiSliderSetValue(s: *mut uiSlider, value: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiSliderHasToolTip(s: *mut uiSlider) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiSliderSetHasToolTip(s: *mut uiSlider, hasToolTip: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiSliderOnChanged(
        s: *mut uiSlider,
        f: ::std::option::Option<
            unsafe extern "C" fn(s: *mut uiSlider, data: *mut ::std::os::raw::c_void),
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiSliderOnReleased(
        s: *mut uiSlider,
        f: ::std::option::Option<
            unsafe extern "C" fn(s: *mut uiSlider, data: *mut ::std::os::raw::c_void),
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiSliderSetRange(
        s: *mut uiSlider,
        min: ::std::os::raw::c_int,
        max: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn uiNewSlider(min: ::std::os::raw::c_int, max: ::std::os::raw::c_int) -> *mut uiSlider;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiProgressBar {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiProgressBarValue(p: *mut uiProgressBar) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiProgressBarSetValue(p: *mut uiProgressBar, n: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiNewProgressBar() -> *mut uiProgressBar;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiSeparator {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiNewHorizontalSeparator() -> *mut uiSeparator;
}
extern "C" {
    pub fn uiNewVerticalSeparator() -> *mut uiSeparator;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiCombobox {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiComboboxAppend(c: *mut uiCombobox, text: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn uiComboboxInsertAt(
        c: *mut uiCombobox,
        n: ::std::os::raw::c_int,
        text: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn uiComboboxDelete(c: *mut uiCombobox, n: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiComboboxClear(c: *mut uiCombobox);
}
extern "C" {
    pub fn uiComboboxNumItems(c: *mut uiCombobox) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiComboboxSelected(c: *mut uiCombobox) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiComboboxSetSelected(c: *mut uiCombobox, n: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiComboboxOnSelected(
        c: *mut uiCombobox,
        f: ::std::option::Option<
            unsafe extern "C" fn(c: *mut uiCombobox, data: *mut ::std::os::raw::c_void),
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiNewCombobox() -> *mut uiCombobox;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiEditableCombobox {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiEditableComboboxAppend(
        c: *mut uiEditableCombobox,
        text: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn uiEditableComboboxText(c: *mut uiEditableCombobox) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn uiEditableComboboxSetText(
        c: *mut uiEditableCombobox,
        text: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn uiEditableComboboxOnChanged(
        c: *mut uiEditableCombobox,
        f: ::std::option::Option<
            unsafe extern "C" fn(c: *mut uiEditableCombobox, data: *mut ::std::os::raw::c_void),
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiNewEditableCombobox() -> *mut uiEditableCombobox;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiRadioButtons {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiRadioButtonsAppend(r: *mut uiRadioButtons, text: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn uiRadioButtonsSelected(r: *mut uiRadioButtons) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiRadioButtonsSetSelected(r: *mut uiRadioButtons, n: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiRadioButtonsOnSelected(
        r: *mut uiRadioButtons,
        f: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut uiRadioButtons, arg2: *mut ::std::os::raw::c_void),
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiNewRadioButtons() -> *mut uiRadioButtons;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiDateTimePicker {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiDateTimePickerTime(d: *mut uiDateTimePicker, time: *mut tm);
}
extern "C" {
    pub fn uiDateTimePickerSetTime(d: *mut uiDateTimePicker, time: *const tm);
}
extern "C" {
    pub fn uiDateTimePickerOnChanged(
        d: *mut uiDateTimePicker,
        f: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut uiDateTimePicker, arg2: *mut ::std::os::raw::c_void),
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiNewDateTimePicker() -> *mut uiDateTimePicker;
}
extern "C" {
    pub fn uiNewDatePicker() -> *mut uiDateTimePicker;
}
extern "C" {
    pub fn uiNewTimePicker() -> *mut uiDateTimePicker;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiMultilineEntry {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiMultilineEntryText(e: *mut uiMultilineEntry) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn uiMultilineEntrySetText(e: *mut uiMultilineEntry, text: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn uiMultilineEntryAppend(e: *mut uiMultilineEntry, text: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn uiMultilineEntryOnChanged(
        e: *mut uiMultilineEntry,
        f: ::std::option::Option<
            unsafe extern "C" fn(e: *mut uiMultilineEntry, data: *mut ::std::os::raw::c_void),
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiMultilineEntryReadOnly(e: *mut uiMultilineEntry) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiMultilineEntrySetReadOnly(e: *mut uiMultilineEntry, readonly: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiNewMultilineEntry() -> *mut uiMultilineEntry;
}
extern "C" {
    pub fn uiNewNonWrappingMultilineEntry() -> *mut uiMultilineEntry;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiMenuItem {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiMenuItemEnable(m: *mut uiMenuItem);
}
extern "C" {
    pub fn uiMenuItemDisable(m: *mut uiMenuItem);
}
extern "C" {
    pub fn uiMenuItemOnClicked(
        m: *mut uiMenuItem,
        f: ::std::option::Option<
            unsafe extern "C" fn(
                sender: *mut uiMenuItem,
                window: *mut uiWindow,
                data: *mut ::std::os::raw::c_void,
            ),
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiMenuItemChecked(m: *mut uiMenuItem) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiMenuItemSetChecked(m: *mut uiMenuItem, checked: ::std::os::raw::c_int);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiMenu {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiMenuAppendItem(m: *mut uiMenu, name: *const ::std::os::raw::c_char)
        -> *mut uiMenuItem;
}
extern "C" {
    pub fn uiMenuAppendCheckItem(
        m: *mut uiMenu,
        name: *const ::std::os::raw::c_char,
    ) -> *mut uiMenuItem;
}
extern "C" {
    pub fn uiMenuAppendQuitItem(m: *mut uiMenu) -> *mut uiMenuItem;
}
extern "C" {
    pub fn uiMenuAppendPreferencesItem(m: *mut uiMenu) -> *mut uiMenuItem;
}
extern "C" {
    pub fn uiMenuAppendAboutItem(m: *mut uiMenu) -> *mut uiMenuItem;
}
extern "C" {
    pub fn uiMenuAppendSeparator(m: *mut uiMenu);
}
extern "C" {
    pub fn uiNewMenu(name: *const ::std::os::raw::c_char) -> *mut uiMenu;
}
extern "C" {
    pub fn uiOpenFile(parent: *mut uiWindow) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn uiOpenFolder(parent: *mut uiWindow) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn uiSaveFile(parent: *mut uiWindow) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn uiMsgBox(
        parent: *mut uiWindow,
        title: *const ::std::os::raw::c_char,
        description: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn uiMsgBoxError(
        parent: *mut uiWindow,
        title: *const ::std::os::raw::c_char,
        description: *const ::std::os::raw::c_char,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiArea {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiDrawContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiAreaHandler {
    pub Draw: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut uiAreaHandler,
            arg2: *mut uiArea,
            arg3: *mut uiAreaDrawParams,
        ),
    >,
    pub MouseEvent: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut uiAreaHandler,
            arg2: *mut uiArea,
            arg3: *mut uiAreaMouseEvent,
        ),
    >,
    pub MouseCrossed: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut uiAreaHandler,
            arg2: *mut uiArea,
            left: ::std::os::raw::c_int,
        ),
    >,
    pub DragBroken:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut uiAreaHandler, arg2: *mut uiArea)>,
    pub KeyEvent: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut uiAreaHandler,
            arg2: *mut uiArea,
            arg3: *mut uiAreaKeyEvent,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_uiAreaHandler() {
    assert_eq!(
        ::std::mem::size_of::<uiAreaHandler>(),
        40usize,
        concat!("Size of: ", stringify!(uiAreaHandler))
    );
    assert_eq!(
        ::std::mem::align_of::<uiAreaHandler>(),
        8usize,
        concat!("Alignment of ", stringify!(uiAreaHandler))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaHandler>())).Draw as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaHandler),
            "::",
            stringify!(Draw)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaHandler>())).MouseEvent as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaHandler),
            "::",
            stringify!(MouseEvent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaHandler>())).MouseCrossed as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaHandler),
            "::",
            stringify!(MouseCrossed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaHandler>())).DragBroken as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaHandler),
            "::",
            stringify!(DragBroken)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaHandler>())).KeyEvent as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaHandler),
            "::",
            stringify!(KeyEvent)
        )
    );
}
pub type uiWindowResizeEdge = ::std::os::raw::c_uint;
pub const uiWindowResizeEdgeLeft: ::std::os::raw::c_uint = 0;
pub const uiWindowResizeEdgeTop: ::std::os::raw::c_uint = 1;
pub const uiWindowResizeEdgeRight: ::std::os::raw::c_uint = 2;
pub const uiWindowResizeEdgeBottom: ::std::os::raw::c_uint = 3;
pub const uiWindowResizeEdgeTopLeft: ::std::os::raw::c_uint = 4;
pub const uiWindowResizeEdgeTopRight: ::std::os::raw::c_uint = 5;
pub const uiWindowResizeEdgeBottomLeft: ::std::os::raw::c_uint = 6;
pub const uiWindowResizeEdgeBottomRight: ::std::os::raw::c_uint = 7;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
extern "C" {
    pub fn uiAreaSetSize(
        a: *mut uiArea,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn uiAreaQueueRedrawAll(a: *mut uiArea);
}
extern "C" {
    pub fn uiAreaScrollTo(a: *mut uiArea, x: f64, y: f64, width: f64, height: f64);
}
extern "C" {
    pub fn uiAreaBeginUserWindowMove(a: *mut uiArea);
}
extern "C" {
    pub fn uiAreaBeginUserWindowResize(a: *mut uiArea, edge: uiWindowResizeEdge);
}
extern "C" {
    pub fn uiNewArea(ah: *mut uiAreaHandler) -> *mut uiArea;
}
extern "C" {
    pub fn uiNewScrollingArea(
        ah: *mut uiAreaHandler,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
    ) -> *mut uiArea;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiAreaDrawParams {
    pub Context: *mut uiDrawContext,
    pub AreaWidth: f64,
    pub AreaHeight: f64,
    pub ClipX: f64,
    pub ClipY: f64,
    pub ClipWidth: f64,
    pub ClipHeight: f64,
}
#[test]
fn bindgen_test_layout_uiAreaDrawParams() {
    assert_eq!(
        ::std::mem::size_of::<uiAreaDrawParams>(),
        56usize,
        concat!("Size of: ", stringify!(uiAreaDrawParams))
    );
    assert_eq!(
        ::std::mem::align_of::<uiAreaDrawParams>(),
        8usize,
        concat!("Alignment of ", stringify!(uiAreaDrawParams))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaDrawParams>())).Context as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaDrawParams),
            "::",
            stringify!(Context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaDrawParams>())).AreaWidth as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaDrawParams),
            "::",
            stringify!(AreaWidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaDrawParams>())).AreaHeight as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaDrawParams),
            "::",
            stringify!(AreaHeight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaDrawParams>())).ClipX as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaDrawParams),
            "::",
            stringify!(ClipX)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaDrawParams>())).ClipY as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaDrawParams),
            "::",
            stringify!(ClipY)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaDrawParams>())).ClipWidth as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaDrawParams),
            "::",
            stringify!(ClipWidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaDrawParams>())).ClipHeight as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaDrawParams),
            "::",
            stringify!(ClipHeight)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiDrawPath {
    _unused: [u8; 0],
}
pub type uiDrawBrushType = ::std::os::raw::c_uint;
pub const uiDrawBrushTypeSolid: ::std::os::raw::c_uint = 0;
pub const uiDrawBrushTypeLinearGradient: ::std::os::raw::c_uint = 1;
pub const uiDrawBrushTypeRadialGradient: ::std::os::raw::c_uint = 2;
pub const uiDrawBrushTypeImage: ::std::os::raw::c_uint = 3;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub type uiDrawLineCap = ::std::os::raw::c_uint;
pub const uiDrawLineCapFlat: ::std::os::raw::c_uint = 0;
pub const uiDrawLineCapRound: ::std::os::raw::c_uint = 1;
pub const uiDrawLineCapSquare: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub type uiDrawLineJoin = ::std::os::raw::c_uint;
pub const uiDrawLineJoinMiter: ::std::os::raw::c_uint = 0;
pub const uiDrawLineJoinRound: ::std::os::raw::c_uint = 1;
pub const uiDrawLineJoinBevel: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
pub type uiDrawFillMode = ::std::os::raw::c_uint;
pub const uiDrawFillModeWinding: ::std::os::raw::c_uint = 0;
pub const uiDrawFillModeAlternate: ::std::os::raw::c_uint = 1;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiDrawMatrix {
    pub M11: f64,
    pub M12: f64,
    pub M21: f64,
    pub M22: f64,
    pub M31: f64,
    pub M32: f64,
}
#[test]
fn bindgen_test_layout_uiDrawMatrix() {
    assert_eq!(
        ::std::mem::size_of::<uiDrawMatrix>(),
        48usize,
        concat!("Size of: ", stringify!(uiDrawMatrix))
    );
    assert_eq!(
        ::std::mem::align_of::<uiDrawMatrix>(),
        8usize,
        concat!("Alignment of ", stringify!(uiDrawMatrix))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawMatrix>())).M11 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawMatrix),
            "::",
            stringify!(M11)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawMatrix>())).M12 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawMatrix),
            "::",
            stringify!(M12)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawMatrix>())).M21 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawMatrix),
            "::",
            stringify!(M21)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawMatrix>())).M22 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawMatrix),
            "::",
            stringify!(M22)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawMatrix>())).M31 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawMatrix),
            "::",
            stringify!(M31)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawMatrix>())).M32 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawMatrix),
            "::",
            stringify!(M32)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiDrawBrush {
    pub Type: uiDrawBrushType,
    pub R: f64,
    pub G: f64,
    pub B: f64,
    pub A: f64,
    pub X0: f64,
    pub Y0: f64,
    pub X1: f64,
    pub Y1: f64,
    pub OuterRadius: f64,
    pub Stops: *mut uiDrawBrushGradientStop,
    pub NumStops: size_t,
}
#[test]
fn bindgen_test_layout_uiDrawBrush() {
    assert_eq!(
        ::std::mem::size_of::<uiDrawBrush>(),
        96usize,
        concat!("Size of: ", stringify!(uiDrawBrush))
    );
    assert_eq!(
        ::std::mem::align_of::<uiDrawBrush>(),
        8usize,
        concat!("Alignment of ", stringify!(uiDrawBrush))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawBrush>())).Type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawBrush),
            "::",
            stringify!(Type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawBrush>())).R as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawBrush),
            "::",
            stringify!(R)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawBrush>())).G as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawBrush),
            "::",
            stringify!(G)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawBrush>())).B as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawBrush),
            "::",
            stringify!(B)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawBrush>())).A as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawBrush),
            "::",
            stringify!(A)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawBrush>())).X0 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawBrush),
            "::",
            stringify!(X0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawBrush>())).Y0 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawBrush),
            "::",
            stringify!(Y0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawBrush>())).X1 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawBrush),
            "::",
            stringify!(X1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawBrush>())).Y1 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawBrush),
            "::",
            stringify!(Y1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawBrush>())).OuterRadius as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawBrush),
            "::",
            stringify!(OuterRadius)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawBrush>())).Stops as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawBrush),
            "::",
            stringify!(Stops)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawBrush>())).NumStops as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawBrush),
            "::",
            stringify!(NumStops)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiDrawBrushGradientStop {
    pub Pos: f64,
    pub R: f64,
    pub G: f64,
    pub B: f64,
    pub A: f64,
}
#[test]
fn bindgen_test_layout_uiDrawBrushGradientStop() {
    assert_eq!(
        ::std::mem::size_of::<uiDrawBrushGradientStop>(),
        40usize,
        concat!("Size of: ", stringify!(uiDrawBrushGradientStop))
    );
    assert_eq!(
        ::std::mem::align_of::<uiDrawBrushGradientStop>(),
        8usize,
        concat!("Alignment of ", stringify!(uiDrawBrushGradientStop))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawBrushGradientStop>())).Pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawBrushGradientStop),
            "::",
            stringify!(Pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawBrushGradientStop>())).R as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawBrushGradientStop),
            "::",
            stringify!(R)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawBrushGradientStop>())).G as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawBrushGradientStop),
            "::",
            stringify!(G)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawBrushGradientStop>())).B as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawBrushGradientStop),
            "::",
            stringify!(B)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawBrushGradientStop>())).A as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawBrushGradientStop),
            "::",
            stringify!(A)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiDrawStrokeParams {
    pub Cap: uiDrawLineCap,
    pub Join: uiDrawLineJoin,
    pub Thickness: f64,
    pub MiterLimit: f64,
    pub Dashes: *mut f64,
    pub NumDashes: size_t,
    pub DashPhase: f64,
}
#[test]
fn bindgen_test_layout_uiDrawStrokeParams() {
    assert_eq!(
        ::std::mem::size_of::<uiDrawStrokeParams>(),
        48usize,
        concat!("Size of: ", stringify!(uiDrawStrokeParams))
    );
    assert_eq!(
        ::std::mem::align_of::<uiDrawStrokeParams>(),
        8usize,
        concat!("Alignment of ", stringify!(uiDrawStrokeParams))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawStrokeParams>())).Cap as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawStrokeParams),
            "::",
            stringify!(Cap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawStrokeParams>())).Join as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawStrokeParams),
            "::",
            stringify!(Join)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawStrokeParams>())).Thickness as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawStrokeParams),
            "::",
            stringify!(Thickness)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawStrokeParams>())).MiterLimit as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawStrokeParams),
            "::",
            stringify!(MiterLimit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawStrokeParams>())).Dashes as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawStrokeParams),
            "::",
            stringify!(Dashes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawStrokeParams>())).NumDashes as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawStrokeParams),
            "::",
            stringify!(NumDashes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawStrokeParams>())).DashPhase as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawStrokeParams),
            "::",
            stringify!(DashPhase)
        )
    );
}
extern "C" {
    pub fn uiDrawNewPath(fillMode: uiDrawFillMode) -> *mut uiDrawPath;
}
extern "C" {
    pub fn uiDrawFreePath(p: *mut uiDrawPath);
}
extern "C" {
    pub fn uiDrawPathNewFigure(p: *mut uiDrawPath, x: f64, y: f64);
}
extern "C" {
    pub fn uiDrawPathNewFigureWithArc(
        p: *mut uiDrawPath,
        xCenter: f64,
        yCenter: f64,
        radius: f64,
        startAngle: f64,
        sweep: f64,
        negative: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn uiDrawPathLineTo(p: *mut uiDrawPath, x: f64, y: f64);
}
extern "C" {
    pub fn uiDrawPathArcTo(
        p: *mut uiDrawPath,
        xCenter: f64,
        yCenter: f64,
        radius: f64,
        startAngle: f64,
        sweep: f64,
        negative: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn uiDrawPathBezierTo(
        p: *mut uiDrawPath,
        c1x: f64,
        c1y: f64,
        c2x: f64,
        c2y: f64,
        endX: f64,
        endY: f64,
    );
}
extern "C" {
    pub fn uiDrawPathCloseFigure(p: *mut uiDrawPath);
}
extern "C" {
    pub fn uiDrawPathAddRectangle(p: *mut uiDrawPath, x: f64, y: f64, width: f64, height: f64);
}
extern "C" {
    pub fn uiDrawPathEnded(p: *mut uiDrawPath) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiDrawPathEnd(p: *mut uiDrawPath);
}
extern "C" {
    pub fn uiDrawStroke(
        c: *mut uiDrawContext,
        path: *mut uiDrawPath,
        b: *mut uiDrawBrush,
        p: *mut uiDrawStrokeParams,
    );
}
extern "C" {
    pub fn uiDrawFill(c: *mut uiDrawContext, path: *mut uiDrawPath, b: *mut uiDrawBrush);
}
extern "C" {
    pub fn uiDrawMatrixSetIdentity(m: *mut uiDrawMatrix);
}
extern "C" {
    pub fn uiDrawMatrixTranslate(m: *mut uiDrawMatrix, x: f64, y: f64);
}
extern "C" {
    pub fn uiDrawMatrixScale(m: *mut uiDrawMatrix, xCenter: f64, yCenter: f64, x: f64, y: f64);
}
extern "C" {
    pub fn uiDrawMatrixRotate(m: *mut uiDrawMatrix, x: f64, y: f64, amount: f64);
}
extern "C" {
    pub fn uiDrawMatrixSkew(m: *mut uiDrawMatrix, x: f64, y: f64, xamount: f64, yamount: f64);
}
extern "C" {
    pub fn uiDrawMatrixMultiply(dest: *mut uiDrawMatrix, src: *mut uiDrawMatrix);
}
extern "C" {
    pub fn uiDrawMatrixInvertible(m: *mut uiDrawMatrix) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiDrawMatrixInvert(m: *mut uiDrawMatrix) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiDrawMatrixTransformPoint(m: *mut uiDrawMatrix, x: *mut f64, y: *mut f64);
}
extern "C" {
    pub fn uiDrawMatrixTransformSize(m: *mut uiDrawMatrix, x: *mut f64, y: *mut f64);
}
extern "C" {
    pub fn uiDrawTransform(c: *mut uiDrawContext, m: *mut uiDrawMatrix);
}
extern "C" {
    pub fn uiDrawClip(c: *mut uiDrawContext, path: *mut uiDrawPath);
}
extern "C" {
    pub fn uiDrawSave(c: *mut uiDrawContext);
}
extern "C" {
    pub fn uiDrawRestore(c: *mut uiDrawContext);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiAttribute {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiFreeAttribute(a: *mut uiAttribute);
}
pub type uiAttributeType = ::std::os::raw::c_uint;
pub const uiAttributeTypeFamily: ::std::os::raw::c_uint = 0;
pub const uiAttributeTypeSize: ::std::os::raw::c_uint = 1;
pub const uiAttributeTypeWeight: ::std::os::raw::c_uint = 2;
pub const uiAttributeTypeItalic: ::std::os::raw::c_uint = 3;
pub const uiAttributeTypeStretch: ::std::os::raw::c_uint = 4;
pub const uiAttributeTypeColor: ::std::os::raw::c_uint = 5;
pub const uiAttributeTypeBackground: ::std::os::raw::c_uint = 6;
pub const uiAttributeTypeUnderline: ::std::os::raw::c_uint = 7;
pub const uiAttributeTypeUnderlineColor: ::std::os::raw::c_uint = 8;
pub const uiAttributeTypeFeatures: ::std::os::raw::c_uint = 9;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
extern "C" {
    pub fn uiAttributeGetType(a: *const uiAttribute) -> uiAttributeType;
}
extern "C" {
    pub fn uiNewFamilyAttribute(family: *const ::std::os::raw::c_char) -> *mut uiAttribute;
}
extern "C" {
    pub fn uiAttributeFamily(a: *const uiAttribute) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn uiNewSizeAttribute(size: f64) -> *mut uiAttribute;
}
extern "C" {
    pub fn uiAttributeSize(a: *const uiAttribute) -> f64;
}
pub type uiTextWeight = ::std::os::raw::c_uint;
pub const uiTextWeightMinimum: ::std::os::raw::c_uint = 0;
pub const uiTextWeightThin: ::std::os::raw::c_uint = 100;
pub const uiTextWeightUltraLight: ::std::os::raw::c_uint = 200;
pub const uiTextWeightLight: ::std::os::raw::c_uint = 300;
pub const uiTextWeightBook: ::std::os::raw::c_uint = 350;
pub const uiTextWeightNormal: ::std::os::raw::c_uint = 400;
pub const uiTextWeightMedium: ::std::os::raw::c_uint = 500;
pub const uiTextWeightSemiBold: ::std::os::raw::c_uint = 600;
pub const uiTextWeightBold: ::std::os::raw::c_uint = 700;
pub const uiTextWeightUltraBold: ::std::os::raw::c_uint = 800;
pub const uiTextWeightHeavy: ::std::os::raw::c_uint = 900;
pub const uiTextWeightUltraHeavy: ::std::os::raw::c_uint = 950;
pub const uiTextWeightMaximum: ::std::os::raw::c_uint = 1000;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
extern "C" {
    pub fn uiNewWeightAttribute(weight: uiTextWeight) -> *mut uiAttribute;
}
extern "C" {
    pub fn uiAttributeWeight(a: *const uiAttribute) -> uiTextWeight;
}
pub type uiTextItalic = ::std::os::raw::c_uint;
pub const uiTextItalicNormal: ::std::os::raw::c_uint = 0;
pub const uiTextItalicOblique: ::std::os::raw::c_uint = 1;
pub const uiTextItalicItalic: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
extern "C" {
    pub fn uiNewItalicAttribute(italic: uiTextItalic) -> *mut uiAttribute;
}
extern "C" {
    pub fn uiAttributeItalic(a: *const uiAttribute) -> uiTextItalic;
}
pub type uiTextStretch = ::std::os::raw::c_uint;
pub const uiTextStretchUltraCondensed: ::std::os::raw::c_uint = 0;
pub const uiTextStretchExtraCondensed: ::std::os::raw::c_uint = 1;
pub const uiTextStretchCondensed: ::std::os::raw::c_uint = 2;
pub const uiTextStretchSemiCondensed: ::std::os::raw::c_uint = 3;
pub const uiTextStretchNormal: ::std::os::raw::c_uint = 4;
pub const uiTextStretchSemiExpanded: ::std::os::raw::c_uint = 5;
pub const uiTextStretchExpanded: ::std::os::raw::c_uint = 6;
pub const uiTextStretchExtraExpanded: ::std::os::raw::c_uint = 7;
pub const uiTextStretchUltraExpanded: ::std::os::raw::c_uint = 8;
pub type _bindgen_ty_10 = ::std::os::raw::c_uint;
extern "C" {
    pub fn uiNewStretchAttribute(stretch: uiTextStretch) -> *mut uiAttribute;
}
extern "C" {
    pub fn uiAttributeStretch(a: *const uiAttribute) -> uiTextStretch;
}
extern "C" {
    pub fn uiNewColorAttribute(r: f64, g: f64, b: f64, a: f64) -> *mut uiAttribute;
}
extern "C" {
    pub fn uiAttributeColor(
        a: *const uiAttribute,
        r: *mut f64,
        g: *mut f64,
        b: *mut f64,
        alpha: *mut f64,
    );
}
extern "C" {
    pub fn uiNewBackgroundAttribute(r: f64, g: f64, b: f64, a: f64) -> *mut uiAttribute;
}
pub type uiUnderline = ::std::os::raw::c_uint;
pub const uiUnderlineNone: ::std::os::raw::c_uint = 0;
pub const uiUnderlineSingle: ::std::os::raw::c_uint = 1;
pub const uiUnderlineDouble: ::std::os::raw::c_uint = 2;
pub const uiUnderlineSuggestion: ::std::os::raw::c_uint = 3;
pub type _bindgen_ty_11 = ::std::os::raw::c_uint;
extern "C" {
    pub fn uiNewUnderlineAttribute(u: uiUnderline) -> *mut uiAttribute;
}
extern "C" {
    pub fn uiAttributeUnderline(a: *const uiAttribute) -> uiUnderline;
}
pub type uiUnderlineColor = ::std::os::raw::c_uint;
pub const uiUnderlineColorCustom: ::std::os::raw::c_uint = 0;
pub const uiUnderlineColorSpelling: ::std::os::raw::c_uint = 1;
pub const uiUnderlineColorGrammar: ::std::os::raw::c_uint = 2;
pub const uiUnderlineColorAuxiliary: ::std::os::raw::c_uint = 3;
pub type _bindgen_ty_12 = ::std::os::raw::c_uint;
extern "C" {
    pub fn uiNewUnderlineColorAttribute(
        u: uiUnderlineColor,
        r: f64,
        g: f64,
        b: f64,
        a: f64,
    ) -> *mut uiAttribute;
}
extern "C" {
    pub fn uiAttributeUnderlineColor(
        a: *const uiAttribute,
        u: *mut uiUnderlineColor,
        r: *mut f64,
        g: *mut f64,
        b: *mut f64,
        alpha: *mut f64,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiOpenTypeFeatures {
    _unused: [u8; 0],
}
pub type uiOpenTypeFeaturesForEachFunc = ::std::option::Option<
    unsafe extern "C" fn(
        otf: *const uiOpenTypeFeatures,
        a: ::std::os::raw::c_char,
        b: ::std::os::raw::c_char,
        c: ::std::os::raw::c_char,
        d: ::std::os::raw::c_char,
        value: u32,
        data: *mut ::std::os::raw::c_void,
    ) -> uiForEach,
>;
extern "C" {
    pub fn uiNewOpenTypeFeatures() -> *mut uiOpenTypeFeatures;
}
extern "C" {
    pub fn uiFreeOpenTypeFeatures(otf: *mut uiOpenTypeFeatures);
}
extern "C" {
    pub fn uiOpenTypeFeaturesClone(otf: *const uiOpenTypeFeatures) -> *mut uiOpenTypeFeatures;
}
extern "C" {
    pub fn uiOpenTypeFeaturesAdd(
        otf: *mut uiOpenTypeFeatures,
        a: ::std::os::raw::c_char,
        b: ::std::os::raw::c_char,
        c: ::std::os::raw::c_char,
        d: ::std::os::raw::c_char,
        value: u32,
    );
}
extern "C" {
    pub fn uiOpenTypeFeaturesRemove(
        otf: *mut uiOpenTypeFeatures,
        a: ::std::os::raw::c_char,
        b: ::std::os::raw::c_char,
        c: ::std::os::raw::c_char,
        d: ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn uiOpenTypeFeaturesGet(
        otf: *const uiOpenTypeFeatures,
        a: ::std::os::raw::c_char,
        b: ::std::os::raw::c_char,
        c: ::std::os::raw::c_char,
        d: ::std::os::raw::c_char,
        value: *mut u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiOpenTypeFeaturesForEach(
        otf: *const uiOpenTypeFeatures,
        f: uiOpenTypeFeaturesForEachFunc,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiNewFeaturesAttribute(otf: *const uiOpenTypeFeatures) -> *mut uiAttribute;
}
extern "C" {
    pub fn uiAttributeFeatures(a: *const uiAttribute) -> *const uiOpenTypeFeatures;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiAttributedString {
    _unused: [u8; 0],
}
pub type uiAttributedStringForEachAttributeFunc = ::std::option::Option<
    unsafe extern "C" fn(
        s: *const uiAttributedString,
        a: *const uiAttribute,
        start: size_t,
        end: size_t,
        data: *mut ::std::os::raw::c_void,
    ) -> uiForEach,
>;
extern "C" {
    pub fn uiNewAttributedString(
        initialString: *const ::std::os::raw::c_char,
    ) -> *mut uiAttributedString;
}
extern "C" {
    pub fn uiFreeAttributedString(s: *mut uiAttributedString);
}
extern "C" {
    pub fn uiAttributedStringString(s: *const uiAttributedString) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn uiAttributedStringLen(s: *const uiAttributedString) -> size_t;
}
extern "C" {
    pub fn uiAttributedStringAppendUnattributed(
        s: *mut uiAttributedString,
        str_: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn uiAttributedStringInsertAtUnattributed(
        s: *mut uiAttributedString,
        str_: *const ::std::os::raw::c_char,
        at: size_t,
    );
}
extern "C" {
    pub fn uiAttributedStringDelete(s: *mut uiAttributedString, start: size_t, end: size_t);
}
extern "C" {
    pub fn uiAttributedStringSetAttribute(
        s: *mut uiAttributedString,
        a: *mut uiAttribute,
        start: size_t,
        end: size_t,
    );
}
extern "C" {
    pub fn uiAttributedStringForEachAttribute(
        s: *const uiAttributedString,
        f: uiAttributedStringForEachAttributeFunc,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiAttributedStringNumGraphemes(s: *mut uiAttributedString) -> size_t;
}
extern "C" {
    pub fn uiAttributedStringByteIndexToGrapheme(s: *mut uiAttributedString, pos: size_t)
        -> size_t;
}
extern "C" {
    pub fn uiAttributedStringGraphemeToByteIndex(s: *mut uiAttributedString, pos: size_t)
        -> size_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiFontDescriptor {
    pub Family: *mut ::std::os::raw::c_char,
    pub Size: f64,
    pub Weight: uiTextWeight,
    pub Italic: uiTextItalic,
    pub Stretch: uiTextStretch,
}
#[test]
fn bindgen_test_layout_uiFontDescriptor() {
    assert_eq!(
        ::std::mem::size_of::<uiFontDescriptor>(),
        32usize,
        concat!("Size of: ", stringify!(uiFontDescriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<uiFontDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(uiFontDescriptor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiFontDescriptor>())).Family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uiFontDescriptor),
            "::",
            stringify!(Family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiFontDescriptor>())).Size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uiFontDescriptor),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiFontDescriptor>())).Weight as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uiFontDescriptor),
            "::",
            stringify!(Weight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiFontDescriptor>())).Italic as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(uiFontDescriptor),
            "::",
            stringify!(Italic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiFontDescriptor>())).Stretch as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uiFontDescriptor),
            "::",
            stringify!(Stretch)
        )
    );
}
extern "C" {
    pub fn uiLoadControlFont(f: *mut uiFontDescriptor);
}
extern "C" {
    pub fn uiFreeFontDescriptor(desc: *mut uiFontDescriptor);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiDrawTextLayout {
    _unused: [u8; 0],
}
pub type uiDrawTextAlign = ::std::os::raw::c_uint;
pub const uiDrawTextAlignLeft: ::std::os::raw::c_uint = 0;
pub const uiDrawTextAlignCenter: ::std::os::raw::c_uint = 1;
pub const uiDrawTextAlignRight: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_13 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiDrawTextLayoutParams {
    pub String: *mut uiAttributedString,
    pub DefaultFont: *mut uiFontDescriptor,
    pub Width: f64,
    pub Align: uiDrawTextAlign,
}
#[test]
fn bindgen_test_layout_uiDrawTextLayoutParams() {
    assert_eq!(
        ::std::mem::size_of::<uiDrawTextLayoutParams>(),
        32usize,
        concat!("Size of: ", stringify!(uiDrawTextLayoutParams))
    );
    assert_eq!(
        ::std::mem::align_of::<uiDrawTextLayoutParams>(),
        8usize,
        concat!("Alignment of ", stringify!(uiDrawTextLayoutParams))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawTextLayoutParams>())).String as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawTextLayoutParams),
            "::",
            stringify!(String)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<uiDrawTextLayoutParams>())).DefaultFont as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawTextLayoutParams),
            "::",
            stringify!(DefaultFont)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawTextLayoutParams>())).Width as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawTextLayoutParams),
            "::",
            stringify!(Width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiDrawTextLayoutParams>())).Align as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uiDrawTextLayoutParams),
            "::",
            stringify!(Align)
        )
    );
}
extern "C" {
    pub fn uiDrawNewTextLayout(params: *mut uiDrawTextLayoutParams) -> *mut uiDrawTextLayout;
}
extern "C" {
    pub fn uiDrawFreeTextLayout(tl: *mut uiDrawTextLayout);
}
extern "C" {
    pub fn uiDrawText(c: *mut uiDrawContext, tl: *mut uiDrawTextLayout, x: f64, y: f64);
}
extern "C" {
    pub fn uiDrawTextLayoutExtents(tl: *mut uiDrawTextLayout, width: *mut f64, height: *mut f64);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiFontButton {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiFontButtonFont(b: *mut uiFontButton, desc: *mut uiFontDescriptor);
}
extern "C" {
    pub fn uiFontButtonOnChanged(
        b: *mut uiFontButton,
        f: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut uiFontButton, arg2: *mut ::std::os::raw::c_void),
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiNewFontButton() -> *mut uiFontButton;
}
extern "C" {
    pub fn uiFreeFontButtonFont(desc: *mut uiFontDescriptor);
}
pub type uiModifiers = ::std::os::raw::c_uint;
pub const uiModifierCtrl: ::std::os::raw::c_uint = 1;
pub const uiModifierAlt: ::std::os::raw::c_uint = 2;
pub const uiModifierShift: ::std::os::raw::c_uint = 4;
pub const uiModifierSuper: ::std::os::raw::c_uint = 8;
pub type _bindgen_ty_14 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiAreaMouseEvent {
    pub X: f64,
    pub Y: f64,
    pub AreaWidth: f64,
    pub AreaHeight: f64,
    pub Down: ::std::os::raw::c_int,
    pub Up: ::std::os::raw::c_int,
    pub Count: ::std::os::raw::c_int,
    pub Modifiers: uiModifiers,
    pub Held1To64: u64,
}
#[test]
fn bindgen_test_layout_uiAreaMouseEvent() {
    assert_eq!(
        ::std::mem::size_of::<uiAreaMouseEvent>(),
        56usize,
        concat!("Size of: ", stringify!(uiAreaMouseEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<uiAreaMouseEvent>(),
        8usize,
        concat!("Alignment of ", stringify!(uiAreaMouseEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaMouseEvent>())).X as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaMouseEvent),
            "::",
            stringify!(X)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaMouseEvent>())).Y as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaMouseEvent),
            "::",
            stringify!(Y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaMouseEvent>())).AreaWidth as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaMouseEvent),
            "::",
            stringify!(AreaWidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaMouseEvent>())).AreaHeight as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaMouseEvent),
            "::",
            stringify!(AreaHeight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaMouseEvent>())).Down as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaMouseEvent),
            "::",
            stringify!(Down)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaMouseEvent>())).Up as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaMouseEvent),
            "::",
            stringify!(Up)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaMouseEvent>())).Count as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaMouseEvent),
            "::",
            stringify!(Count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaMouseEvent>())).Modifiers as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaMouseEvent),
            "::",
            stringify!(Modifiers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaMouseEvent>())).Held1To64 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaMouseEvent),
            "::",
            stringify!(Held1To64)
        )
    );
}
pub type uiExtKey = ::std::os::raw::c_uint;
pub const uiExtKeyEscape: ::std::os::raw::c_uint = 1;
pub const uiExtKeyInsert: ::std::os::raw::c_uint = 2;
pub const uiExtKeyDelete: ::std::os::raw::c_uint = 3;
pub const uiExtKeyHome: ::std::os::raw::c_uint = 4;
pub const uiExtKeyEnd: ::std::os::raw::c_uint = 5;
pub const uiExtKeyPageUp: ::std::os::raw::c_uint = 6;
pub const uiExtKeyPageDown: ::std::os::raw::c_uint = 7;
pub const uiExtKeyUp: ::std::os::raw::c_uint = 8;
pub const uiExtKeyDown: ::std::os::raw::c_uint = 9;
pub const uiExtKeyLeft: ::std::os::raw::c_uint = 10;
pub const uiExtKeyRight: ::std::os::raw::c_uint = 11;
pub const uiExtKeyF1: ::std::os::raw::c_uint = 12;
pub const uiExtKeyF2: ::std::os::raw::c_uint = 13;
pub const uiExtKeyF3: ::std::os::raw::c_uint = 14;
pub const uiExtKeyF4: ::std::os::raw::c_uint = 15;
pub const uiExtKeyF5: ::std::os::raw::c_uint = 16;
pub const uiExtKeyF6: ::std::os::raw::c_uint = 17;
pub const uiExtKeyF7: ::std::os::raw::c_uint = 18;
pub const uiExtKeyF8: ::std::os::raw::c_uint = 19;
pub const uiExtKeyF9: ::std::os::raw::c_uint = 20;
pub const uiExtKeyF10: ::std::os::raw::c_uint = 21;
pub const uiExtKeyF11: ::std::os::raw::c_uint = 22;
pub const uiExtKeyF12: ::std::os::raw::c_uint = 23;
pub const uiExtKeyN0: ::std::os::raw::c_uint = 24;
pub const uiExtKeyN1: ::std::os::raw::c_uint = 25;
pub const uiExtKeyN2: ::std::os::raw::c_uint = 26;
pub const uiExtKeyN3: ::std::os::raw::c_uint = 27;
pub const uiExtKeyN4: ::std::os::raw::c_uint = 28;
pub const uiExtKeyN5: ::std::os::raw::c_uint = 29;
pub const uiExtKeyN6: ::std::os::raw::c_uint = 30;
pub const uiExtKeyN7: ::std::os::raw::c_uint = 31;
pub const uiExtKeyN8: ::std::os::raw::c_uint = 32;
pub const uiExtKeyN9: ::std::os::raw::c_uint = 33;
pub const uiExtKeyNDot: ::std::os::raw::c_uint = 34;
pub const uiExtKeyNEnter: ::std::os::raw::c_uint = 35;
pub const uiExtKeyNAdd: ::std::os::raw::c_uint = 36;
pub const uiExtKeyNSubtract: ::std::os::raw::c_uint = 37;
pub const uiExtKeyNMultiply: ::std::os::raw::c_uint = 38;
pub const uiExtKeyNDivide: ::std::os::raw::c_uint = 39;
pub type _bindgen_ty_15 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiAreaKeyEvent {
    pub Key: ::std::os::raw::c_char,
    pub ExtKey: uiExtKey,
    pub Modifier: uiModifiers,
    pub Modifiers: uiModifiers,
    pub Up: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_uiAreaKeyEvent() {
    assert_eq!(
        ::std::mem::size_of::<uiAreaKeyEvent>(),
        20usize,
        concat!("Size of: ", stringify!(uiAreaKeyEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<uiAreaKeyEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(uiAreaKeyEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaKeyEvent>())).Key as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaKeyEvent),
            "::",
            stringify!(Key)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaKeyEvent>())).ExtKey as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaKeyEvent),
            "::",
            stringify!(ExtKey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaKeyEvent>())).Modifier as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaKeyEvent),
            "::",
            stringify!(Modifier)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaKeyEvent>())).Modifiers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaKeyEvent),
            "::",
            stringify!(Modifiers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiAreaKeyEvent>())).Up as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uiAreaKeyEvent),
            "::",
            stringify!(Up)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiColorButton {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiColorButtonColor(
        b: *mut uiColorButton,
        r: *mut f64,
        g: *mut f64,
        bl: *mut f64,
        a: *mut f64,
    );
}
extern "C" {
    pub fn uiColorButtonSetColor(b: *mut uiColorButton, r: f64, g: f64, bl: f64, a: f64);
}
extern "C" {
    pub fn uiColorButtonOnChanged(
        b: *mut uiColorButton,
        f: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut uiColorButton, arg2: *mut ::std::os::raw::c_void),
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn uiNewColorButton() -> *mut uiColorButton;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiForm {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiFormAppend(
        f: *mut uiForm,
        label: *const ::std::os::raw::c_char,
        c: *mut uiControl,
        stretchy: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn uiFormNumChildren(f: *mut uiForm) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiFormDelete(f: *mut uiForm, index: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiFormPadded(f: *mut uiForm) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiFormSetPadded(f: *mut uiForm, padded: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiNewForm() -> *mut uiForm;
}
pub type uiAlign = ::std::os::raw::c_uint;
pub const uiAlignFill: ::std::os::raw::c_uint = 0;
pub const uiAlignStart: ::std::os::raw::c_uint = 1;
pub const uiAlignCenter: ::std::os::raw::c_uint = 2;
pub const uiAlignEnd: ::std::os::raw::c_uint = 3;
pub type _bindgen_ty_16 = ::std::os::raw::c_uint;
pub type uiAt = ::std::os::raw::c_uint;
pub const uiAtLeading: ::std::os::raw::c_uint = 0;
pub const uiAtTop: ::std::os::raw::c_uint = 1;
pub const uiAtTrailing: ::std::os::raw::c_uint = 2;
pub const uiAtBottom: ::std::os::raw::c_uint = 3;
pub type _bindgen_ty_17 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiGrid {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiGridAppend(
        g: *mut uiGrid,
        c: *mut uiControl,
        left: ::std::os::raw::c_int,
        top: ::std::os::raw::c_int,
        xspan: ::std::os::raw::c_int,
        yspan: ::std::os::raw::c_int,
        hexpand: ::std::os::raw::c_int,
        halign: uiAlign,
        vexpand: ::std::os::raw::c_int,
        valign: uiAlign,
    );
}
extern "C" {
    pub fn uiGridInsertAt(
        g: *mut uiGrid,
        c: *mut uiControl,
        existing: *mut uiControl,
        at: uiAt,
        xspan: ::std::os::raw::c_int,
        yspan: ::std::os::raw::c_int,
        hexpand: ::std::os::raw::c_int,
        halign: uiAlign,
        vexpand: ::std::os::raw::c_int,
        valign: uiAlign,
    );
}
extern "C" {
    pub fn uiGridPadded(g: *mut uiGrid) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiGridSetPadded(g: *mut uiGrid, padded: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiNewGrid() -> *mut uiGrid;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiImage {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiNewImage(width: f64, height: f64) -> *mut uiImage;
}
extern "C" {
    pub fn uiFreeImage(i: *mut uiImage);
}
extern "C" {
    pub fn uiImageAppend(
        i: *mut uiImage,
        pixels: *mut ::std::os::raw::c_void,
        pixelWidth: ::std::os::raw::c_int,
        pixelHeight: ::std::os::raw::c_int,
        byteStride: ::std::os::raw::c_int,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiTableValue {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiFreeTableValue(v: *mut uiTableValue);
}
pub type uiTableValueType = ::std::os::raw::c_uint;
pub const uiTableValueTypeString: ::std::os::raw::c_uint = 0;
pub const uiTableValueTypeImage: ::std::os::raw::c_uint = 1;
pub const uiTableValueTypeInt: ::std::os::raw::c_uint = 2;
pub const uiTableValueTypeColor: ::std::os::raw::c_uint = 3;
pub type _bindgen_ty_18 = ::std::os::raw::c_uint;
extern "C" {
    pub fn uiTableValueGetType(v: *const uiTableValue) -> uiTableValueType;
}
extern "C" {
    pub fn uiNewTableValueString(str_: *const ::std::os::raw::c_char) -> *mut uiTableValue;
}
extern "C" {
    pub fn uiTableValueString(v: *const uiTableValue) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn uiNewTableValueImage(img: *mut uiImage) -> *mut uiTableValue;
}
extern "C" {
    pub fn uiTableValueImage(v: *const uiTableValue) -> *mut uiImage;
}
extern "C" {
    pub fn uiNewTableValueInt(i: ::std::os::raw::c_int) -> *mut uiTableValue;
}
extern "C" {
    pub fn uiTableValueInt(v: *const uiTableValue) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uiNewTableValueColor(r: f64, g: f64, b: f64, a: f64) -> *mut uiTableValue;
}
extern "C" {
    pub fn uiTableValueColor(
        v: *const uiTableValue,
        r: *mut f64,
        g: *mut f64,
        b: *mut f64,
        a: *mut f64,
    );
}
pub type uiSortIndicator = ::std::os::raw::c_uint;
pub const uiSortIndicatorNone: ::std::os::raw::c_uint = 0;
pub const uiSortIndicatorAscending: ::std::os::raw::c_uint = 1;
pub const uiSortIndicatorDescending: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_19 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiTableModel {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiTableModelHandler {
    pub NumColumns: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut uiTableModelHandler,
            arg2: *mut uiTableModel,
        ) -> ::std::os::raw::c_int,
    >,
    pub ColumnType: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut uiTableModelHandler,
            arg2: *mut uiTableModel,
            arg3: ::std::os::raw::c_int,
        ) -> uiTableValueType,
    >,
    pub NumRows: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut uiTableModelHandler,
            arg2: *mut uiTableModel,
        ) -> ::std::os::raw::c_int,
    >,
    pub CellValue: ::std::option::Option<
        unsafe extern "C" fn(
            mh: *mut uiTableModelHandler,
            m: *mut uiTableModel,
            row: ::std::os::raw::c_int,
            column: ::std::os::raw::c_int,
        ) -> *mut uiTableValue,
    >,
    pub SetCellValue: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut uiTableModelHandler,
            arg2: *mut uiTableModel,
            arg3: ::std::os::raw::c_int,
            arg4: ::std::os::raw::c_int,
            arg5: *const uiTableValue,
        ),
    >,
}
#[test]
fn bindgen_test_layout_uiTableModelHandler() {
    assert_eq!(
        ::std::mem::size_of::<uiTableModelHandler>(),
        40usize,
        concat!("Size of: ", stringify!(uiTableModelHandler))
    );
    assert_eq!(
        ::std::mem::align_of::<uiTableModelHandler>(),
        8usize,
        concat!("Alignment of ", stringify!(uiTableModelHandler))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiTableModelHandler>())).NumColumns as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uiTableModelHandler),
            "::",
            stringify!(NumColumns)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiTableModelHandler>())).ColumnType as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uiTableModelHandler),
            "::",
            stringify!(ColumnType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiTableModelHandler>())).NumRows as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(uiTableModelHandler),
            "::",
            stringify!(NumRows)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiTableModelHandler>())).CellValue as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(uiTableModelHandler),
            "::",
            stringify!(CellValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<uiTableModelHandler>())).SetCellValue as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(uiTableModelHandler),
            "::",
            stringify!(SetCellValue)
        )
    );
}
extern "C" {
    pub fn uiNewTableModel(mh: *mut uiTableModelHandler) -> *mut uiTableModel;
}
extern "C" {
    pub fn uiFreeTableModel(m: *mut uiTableModel);
}
extern "C" {
    pub fn uiTableModelRowInserted(m: *mut uiTableModel, newIndex: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiTableModelRowChanged(m: *mut uiTableModel, index: ::std::os::raw::c_int);
}
extern "C" {
    pub fn uiTableModelRowDeleted(m: *mut uiTableModel, oldIndex: ::std::os::raw::c_int);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiTableTextColumnOptionalParams {
    pub ColorModelColumn: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_uiTableTextColumnOptionalParams() {
    assert_eq!(
        ::std::mem::size_of::<uiTableTextColumnOptionalParams>(),
        4usize,
        concat!("Size of: ", stringify!(uiTableTextColumnOptionalParams))
    );
    assert_eq!(
        ::std::mem::align_of::<uiTableTextColumnOptionalParams>(),
        4usize,
        concat!("Alignment of ", stringify!(uiTableTextColumnOptionalParams))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<uiTableTextColumnOptionalParams>())).ColorModelColumn as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uiTableTextColumnOptionalParams),
            "::",
            stringify!(ColorModelColumn)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiTableParams {
    pub Model: *mut uiTableModel,
    pub RowBackgroundColorModelColumn: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_uiTableParams() {
    assert_eq!(
        ::std::mem::size_of::<uiTableParams>(),
        16usize,
        concat!("Size of: ", stringify!(uiTableParams))
    );
    assert_eq!(
        ::std::mem::align_of::<uiTableParams>(),
        8usize,
        concat!("Alignment of ", stringify!(uiTableParams))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<uiTableParams>())).Model as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uiTableParams),
            "::",
            stringify!(Model)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<uiTableParams>())).RowBackgroundColorModelColumn as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(uiTableParams),
            "::",
            stringify!(RowBackgroundColorModelColumn)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uiTable {
    _unused: [u8; 0],
}
extern "C" {
    pub fn uiTableAppendTextColumn(
        t: *mut uiTable,
        name: *const ::std::os::raw::c_char,
        textModelColumn: ::std::os::raw::c_int,
        textEditableModelColumn: ::std::os::raw::c_int,
        textParams: *mut uiTableTextColumnOptionalParams,
    );
}
extern "C" {
    pub fn uiTableAppendImageColumn(
        t: *mut uiTable,
        name: *const ::std::os::raw::c_char,
        imageModelColumn: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn uiTableAppendImageTextColumn(
        t: *mut uiTable,
        name: *const ::std::os::raw::c_char,
        imageModelColumn: ::std::os::raw::c_int,
        textModelColumn: ::std::os::raw::c_int,
        textEditableModelColumn: ::std::os::raw::c_int,
